espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: I3C DEVICE CTRL REG */
/** Type of device_ctrl register
 *  DEVICE_CTRL register controls the transfer properties and disposition of
 *  controllers capabilities.
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** reg_ba_include : R/W; bitpos: [1]; default: 0;
         *  This bit is used to include I3C broadcast address(0x7E) for private transfer.(If
         *  I3C broadcast address is not include for the private transfer, In-Band Interrupts
         *  driven from Slaves may not win address arbitration. Hence IBIs will get delayed)
         */
        uint32_t reg_ba_include:1;
        /** reg_trans_start : R/W; bitpos: [2]; default: 0;
         *  Transfer Start
         */
        uint32_t reg_trans_start:1;
        /** reg_clk_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t reg_clk_en:1;
        /** reg_ibi_rstart_trans_en : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t reg_ibi_rstart_trans_en:1;
        /** reg_auto_dis_ibi_en : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t reg_auto_dis_ibi_en:1;
        /** reg_dma_rx_en : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t reg_dma_rx_en:1;
        /** reg_dma_tx_en : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t reg_dma_tx_en:1;
        /** reg_multi_slv_single_ccc_en : R/W; bitpos: [8]; default: 0;
         *  0: rx high bit first, 1: rx low bit first
         */
        uint32_t reg_multi_slv_single_ccc_en:1;
        /** reg_rx_bit_order : R/W; bitpos: [9]; default: 0;
         *  0: rx low byte fist, 1: rx high byte first
         */
        uint32_t reg_rx_bit_order:1;
        /** reg_rx_byte_order : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t reg_rx_byte_order:1;
        /** reg_scl_pullup_force_en : R/W; bitpos: [11]; default: 0;
         *  This bit is used to force scl_pullup_en
         */
        uint32_t reg_scl_pullup_force_en:1;
        /** reg_scl_oe_force_en : R/W; bitpos: [12]; default: 1;
         *  This bit is used to force scl_oe
         */
        uint32_t reg_scl_oe_force_en:1;
        /** reg_sda_pp_rd_pullup_en : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t reg_sda_pp_rd_pullup_en:1;
        /** reg_sda_rd_tbit_hlvl_pullup_en : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t reg_sda_rd_tbit_hlvl_pullup_en:1;
        /** reg_sda_pp_wr_pullup_en : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t reg_sda_pp_wr_pullup_en:1;
        /** reg_data_byte_cnt_unlatch : R/W; bitpos: [16]; default: 0;
         *  1: read current real-time updated value  0: read latch data byte cnt value
         */
        uint32_t reg_data_byte_cnt_unlatch:1;
        /** reg_mem_clk_force_on : R/W; bitpos: [17]; default: 0;
         *  1: dev characteristic and address table memory clk  date force on . 0 :  clock
         *  gating by rd/wr.
         */
        uint32_t reg_mem_clk_force_on:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} i3c_mst_device_ctrl_reg_t;


/** Group: I3C BUFFER THLD CTRL REG */
/** Type of buffer_thld_ctrl register
 *  In-Band Interrupt Status Threshold Value . Every In Band Interrupt received by I3C
 *  controller generates an IBI status. This field controls the number of IBI status
 *  entries in the IBI buffer that trigger the IBI_STATUS_THLD_STAT interrupt.
 */
typedef union {
    struct {
        /** reg_cmd_buf_empty_thld : R/W; bitpos: [3:0]; default: 1;
         *  Command Buffer Empty Threshold Value is used to control the number of empty
         *  locations(or greater) in the Command Buffer that trigger CMD_BUFFER_READY_STAT
         *  interrupt.
         */
        uint32_t reg_cmd_buf_empty_thld:4;
        uint32_t reserved_4:2;
        /** reg_resp_buf_thld : R/W; bitpos: [8:6]; default: 1;
         *  Response Buffer Threshold Value is used to control the number of entries in the
         *  Response Buffer that trigger the RESP_READY_STAT_INTR.
         */
        uint32_t reg_resp_buf_thld:3;
        uint32_t reserved_9:3;
        /** reg_ibi_data_buf_thld : R/W; bitpos: [14:12]; default: 1;
         *  In-Band Interrupt Data Threshold Value . Every In Band Interrupt received by I3C
         *  controller generates an IBI status. This field controls the number of IBI data
         *  entries in the IBI buffer that trigger the IBI_DATA_THLD_STAT interrupt.
         */
        uint32_t reg_ibi_data_buf_thld:3;
        uint32_t reserved_15:3;
        /** reg_ibi_status_buf_thld : R/W; bitpos: [20:18]; default: 1;
         *  NA
         */
        uint32_t reg_ibi_status_buf_thld:3;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} i3c_mst_buffer_thld_ctrl_reg_t;


/** Group: I3C DATA BUFFER THLD CTRL REG */
/** Type of data_buffer_thld_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_tx_data_buf_thld : R/W; bitpos: [2:0]; default: 1;
         *  Transmit Buffer Threshold Value. This field controls the number of empty locations
         *  in the Transmit FIFO that trigger the TX_THLD_STAT interrupt. Supports values:
         *  000:2  001:4  010:8  011:16  100:31, else:31
         */
        uint32_t reg_tx_data_buf_thld:3;
        /** reg_rx_data_buf_thld : R/W; bitpos: [5:3]; default: 1;
         *  Receive Buffer Threshold Value. This field controls the number of empty locations
         *  in the Receive FIFO that trigger the RX_THLD_STAT interrupt. Supports: 000:2  001:4
         *  010:8  011:16  100:31, else:31
         */
        uint32_t reg_rx_data_buf_thld:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} i3c_mst_data_buffer_thld_ctrl_reg_t;


