espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_struct.h
/** Group: I3C IBI NOTIFY CTRL REG */
/** Type of ibi_notify_ctrl register
 *  NA
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** reg_notify_sir_rejected : R/W; bitpos: [2]; default: 0;
         *  Notify Rejected Slave Interrupt Request Control. This bit is used to suppress
         *  reporting to the application about Slave Interrupt Request. 0:Suppress passing the
         *  IBI Status to the IBI FIFO(hence not notifying the application) when a SIR request
         *  is NACKed and auto-disabled base on the IBI_SIR_REQ_REJECT register. 1: Writes IBI
         *  Status to the IBI FIFO(hence notifying the application) when SIR request is NACKed
         *  and auto-disabled based on the IBI_SIR_REQ_REJECT registerl.
         */
        uint32_t reg_notify_sir_rejected:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} i3c_mst_ibi_notify_ctrl_reg_t;


/** Group: I3C IBI SIR REQ PAYLOAD REG */
/** Type of ibi_sir_req_payload register
 *  NA
 */
typedef union {
    struct {
        /** reg_sir_req_payload : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_sir_req_payload:32;
    };
    uint32_t val;
} i3c_mst_ibi_sir_req_payload_reg_t;


/** Group: I3C IBI SIR REQ REJECT REG */
/** Type of ibi_sir_req_reject register
 *  NA
 */
typedef union {
    struct {
        /** reg_sir_req_reject : R/W; bitpos: [31:0]; default: 0;
         *  The application of controller can decide whether to send ACK or NACK for Slave
         *  request received from any I3C device. A device specific response control bit is
         *  provided to select the response option, Master will ACK/NACK the Master Request
         *  based on programming of control bit, corresponding to the interrupting device.
         *  0:ACK the SIR Request  1:NACK and send direct auto disable CCC
         */
        uint32_t reg_sir_req_reject:32;
    };
    uint32_t val;
} i3c_mst_ibi_sir_req_reject_reg_t;


/** Group: I3C INT CLR REG */
/** Type of int_clr register
 *  NA
 */
typedef union {
    struct {
        /** tx_data_buf_thld_int_clr : WT; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t tx_data_buf_thld_int_clr:1;
        /** rx_data_buf_thld_int_clr : WT; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t rx_data_buf_thld_int_clr:1;
        /** ibi_status_thld_int_clr : WT; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ibi_status_thld_int_clr:1;
        /** cmd_buf_empty_thld_int_clr : WT; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t cmd_buf_empty_thld_int_clr:1;
        /** resp_ready_int_clr : WT; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t resp_ready_int_clr:1;
        /** nxt_cmd_req_err_int_clr : WT; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t nxt_cmd_req_err_int_clr:1;
        /** transfer_err_int_clr : WT; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t transfer_err_int_clr:1;
        /** transfer_complete_int_clr : WT; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t transfer_complete_int_clr:1;
        /** command_done_int_clr : WT; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t command_done_int_clr:1;
        /** detect_start_int_clr : WT; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t detect_start_int_clr:1;
        /** resp_buf_ovf_int_clr : WT; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t resp_buf_ovf_int_clr:1;
        /** ibi_data_buf_ovf_int_clr : WT; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ibi_data_buf_ovf_int_clr:1;
        /** ibi_status_buf_ovf_int_clr : WT; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ibi_status_buf_ovf_int_clr:1;
        /** ibi_handle_done_int_clr : WT; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ibi_handle_done_int_clr:1;
        /** ibi_detect_int_clr : WT; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ibi_detect_int_clr:1;
        /** cmd_ccc_mismatch_int_clr : WT; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t cmd_ccc_mismatch_int_clr:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_int_clr_reg_t;


/** Group: I3C INT RAW REG */
/** Type of int_raw register
 *  NA
 */
typedef union {
    struct {
        /** tx_data_buf_thld_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t tx_data_buf_thld_int_raw:1;
        /** rx_data_buf_thld_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t rx_data_buf_thld_int_raw:1;
        /** ibi_status_thld_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ibi_status_thld_int_raw:1;
        /** cmd_buf_empty_thld_int_raw : R/WTC/SS; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t cmd_buf_empty_thld_int_raw:1;
        /** resp_ready_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t resp_ready_int_raw:1;
        /** nxt_cmd_req_err_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t nxt_cmd_req_err_int_raw:1;
        /** transfer_err_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t transfer_err_int_raw:1;
        /** transfer_complete_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t transfer_complete_int_raw:1;
        /** command_done_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t command_done_int_raw:1;
        /** detect_start_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t detect_start_int_raw:1;
        /** resp_buf_ovf_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t resp_buf_ovf_int_raw:1;
        /** ibi_data_buf_ovf_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ibi_data_buf_ovf_int_raw:1;
        /** ibi_status_buf_ovf_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ibi_status_buf_ovf_int_raw:1;
        /** ibi_handle_done_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ibi_handle_done_int_raw:1;
        /** ibi_detect_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ibi_detect_int_raw:1;
        /** cmd_ccc_mismatch_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t cmd_ccc_mismatch_int_raw:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_int_raw_reg_t;


/** Group: I3C INT ST REG */
/** Type of int_st register
 *  NA
 */
typedef union {
    struct {
        /** tx_data_buf_thld_int_st : RO; bitpos: [0]; default: 0;
         *  This interrupt is generated when number of empty locations in transmit buffer is
         *  greater than or equal to threshold value specified by TX_EMPTY_BUS_THLD field in
         *  DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
         *  number of empty locations in transmit buffer is less than threshold value.
         */
        uint32_t tx_data_buf_thld_int_st:1;
        /** rx_data_buf_thld_int_st : RO; bitpos: [1]; default: 0;
         *  This interrupt is generated when number of entries in receive buffer is greater
         *  than or equal to threshold value specified by RX_BUF_THLD field in
         *  DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
         *  number of entries in receive buffer is less than threshold value.
         */
        uint32_t rx_data_buf_thld_int_st:1;
        /** ibi_status_thld_int_st : RO; bitpos: [2]; default: 0;
         *  Only used in master mode. This interrupt is generated when number of entries in IBI
         *  buffer is greater than or equal to threshold value specified by IBI_BUF_THLD field
         *  in BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when
         *  number of entries in IBI buffer is less than threshold value.
         */
        uint32_t ibi_status_thld_int_st:1;
        /** cmd_buf_empty_thld_int_st : RO; bitpos: [3]; default: 0;
         *  This interrupt is generated when number of empty locations in command buffer is
         *  greater than or equal to threshold value specified by CMD_EMPTY_BUF_THLD field in
         *  BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number
         *  of empty locations in command buffer is less than threshold value.
         */
        uint32_t cmd_buf_empty_thld_int_st:1;
        /** resp_ready_int_st : RO; bitpos: [4]; default: 0;
         *  This interrupt is generated when number of entries in response buffer is greater
         *  than or equal to threshold value specified by RESP_BUF_THLD field in
         *  BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number
         *  of entries in response buffer is less than threshold value.
         */
        uint32_t resp_ready_int_st:1;
        /** nxt_cmd_req_err_int_st : RO; bitpos: [5]; default: 0;
         *  This interrupt is generated if toc is 0(master will restart next command), but
         *  command buf is empty.
         */
        uint32_t nxt_cmd_req_err_int_st:1;
        /** transfer_err_int_st : RO; bitpos: [6]; default: 0;
         *  This interrupt is generated if any error occurs during transfer. The error type
         *  will be specified in the response packet associated with the command (in ERR_STATUS
         *  field of RESPONSE_BUFFER_PORT register). This bit can be cleared by writing 1'h1.
         */
        uint32_t transfer_err_int_st:1;
        /** transfer_complete_int_st : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t transfer_complete_int_st:1;
        /** command_done_int_st : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t command_done_int_st:1;
        /** detect_start_int_st : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t detect_start_int_st:1;
        /** resp_buf_ovf_int_st : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t resp_buf_ovf_int_st:1;
        /** ibi_data_buf_ovf_int_st : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ibi_data_buf_ovf_int_st:1;
        /** ibi_status_buf_ovf_int_st : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ibi_status_buf_ovf_int_st:1;
        /** ibi_handle_done_int_st : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ibi_handle_done_int_st:1;
        /** ibi_detect_int_st : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ibi_detect_int_st:1;
        /** cmd_ccc_mismatch_int_st : RO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t cmd_ccc_mismatch_int_st:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_int_st_reg_t;


