espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_struct.h
/** Group: I3C INT ST ENA REG */
/** Type of int_st_ena register
 *  The Interrupt status will be updated in INTR_STATUS register if corresponding
 *  Status Enable bit set.
 */
typedef union {
    struct {
        /** tx_data_buf_thld_int_ena : R/W; bitpos: [0]; default: 0;
         *  Transmit Buffer threshold status enable.
         */
        uint32_t tx_data_buf_thld_int_ena:1;
        /** rx_data_buf_thld_int_ena : R/W; bitpos: [1]; default: 0;
         *  Receive Buffer threshold status enable.
         */
        uint32_t rx_data_buf_thld_int_ena:1;
        /** ibi_status_thld_int_ena : R/W; bitpos: [2]; default: 0;
         *  Only used in master mode. IBI Buffer threshold status enable.
         */
        uint32_t ibi_status_thld_int_ena:1;
        /** cmd_buf_empty_thld_int_ena : R/W; bitpos: [3]; default: 0;
         *  Command buffer ready status enable.
         */
        uint32_t cmd_buf_empty_thld_int_ena:1;
        /** resp_ready_int_ena : R/W; bitpos: [4]; default: 0;
         *  Response buffer ready status enable.
         */
        uint32_t resp_ready_int_ena:1;
        /** nxt_cmd_req_err_int_ena : R/W; bitpos: [5]; default: 0;
         *  next command request error status enable
         */
        uint32_t nxt_cmd_req_err_int_ena:1;
        /** transfer_err_int_ena : R/W; bitpos: [6]; default: 0;
         *  Transfer error status enable
         */
        uint32_t transfer_err_int_ena:1;
        /** transfer_complete_int_ena : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t transfer_complete_int_ena:1;
        /** command_done_int_ena : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t command_done_int_ena:1;
        /** detect_start_int_ena : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t detect_start_int_ena:1;
        /** resp_buf_ovf_int_ena : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t resp_buf_ovf_int_ena:1;
        /** ibi_data_buf_ovf_int_ena : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ibi_data_buf_ovf_int_ena:1;
        /** ibi_status_buf_ovf_int_ena : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ibi_status_buf_ovf_int_ena:1;
        /** ibi_handle_done_int_ena : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ibi_handle_done_int_ena:1;
        /** ibi_detect_int_ena : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ibi_detect_int_ena:1;
        /** cmd_ccc_mismatch_int_ena : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t cmd_ccc_mismatch_int_ena:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_int_st_ena_reg_t;


/** Group: I3C RESET CTRL REG */
/** Type of reset_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_core_soft_rst : WT; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_core_soft_rst:1;
        /** reg_cmd_buf_rst : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_cmd_buf_rst:1;
        /** reg_resp_buf_rst : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_resp_buf_rst:1;
        /** reg_tx_data_buf_buf_rst : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t reg_tx_data_buf_buf_rst:1;
        /** reg_rx_data_buf_rst : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t reg_rx_data_buf_rst:1;
        /** reg_ibi_data_buf_rst : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t reg_ibi_data_buf_rst:1;
        /** reg_ibi_status_buf_rst : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t reg_ibi_status_buf_rst:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} i3c_mst_reset_ctrl_reg_t;


/** Group: I3C BUFFER STATUS LEVEL REG */
/** Type of buffer_status_level register
 *  BUFFER_STATUS_LEVEL reflects the status level of Buffers in the controller.
 */
typedef union {
    struct {
        /** cmd_buf_empty_cnt : RO; bitpos: [4:0]; default: 16;
         *  Command Buffer Empty Locations contains the number of empty locations in the
         *  command buffer.
         */
        uint32_t cmd_buf_empty_cnt:5;
        uint32_t reserved_5:3;
        /** resp_buf_cnt : RO; bitpos: [11:8]; default: 0;
         *  Response Buffer Level Value contains the number of valid data entries in the
         *  response buffer.
         */
        uint32_t resp_buf_cnt:4;
        uint32_t reserved_12:4;
        /** ibi_data_buf_cnt : RO; bitpos: [19:16]; default: 0;
         *  IBI Buffer Level Value contains the number of valid entries in the IBI Buffer. This
         *  is field is used in master mode.
         */
        uint32_t ibi_data_buf_cnt:4;
        uint32_t reserved_20:4;
        /** ibi_status_buf_cnt : RO; bitpos: [27:24]; default: 0;
         *  IBI Buffer Status Count contains the number of IBI status entries in the IBI
         *  Buffer. This field is used in master mode.
         */
        uint32_t ibi_status_buf_cnt:4;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} i3c_mst_buffer_status_level_reg_t;


/** Group: I3C DATA BUFFER STATUS LEVEL REG */
/** Type of data_buffer_status_level register
 *  DATA_BUFFER_STATUS_LEVEL reflects the status level of the Buffers in the controller.
 */
typedef union {
    struct {
        /** tx_data_buf_empty_cnt : RO; bitpos: [5:0]; default: 32;
         *  Transmit Buffer Empty Level Value contains the number of empty locations in the
         *  transmit Buffer.
         */
        uint32_t tx_data_buf_empty_cnt:6;
        uint32_t reserved_6:10;
        /** rx_data_buf_cnt : RO; bitpos: [21:16]; default: 0;
         *  Receive Buffer Level value contains the number of valid data entries in the receive
         *  buffer.
         */
        uint32_t rx_data_buf_cnt:6;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} i3c_mst_data_buffer_status_level_reg_t;


/** Group: I3C PRESENT STATE0 REG */
/** Type of present_state0 register
 *  NA
 */
typedef union {
    struct {
        /** sda_lvl : RO; bitpos: [0]; default: 1;
         *  This bit is used to check the SCL line level to recover from error and  for
         *  debugging. This bit reflects the value of synchronized scl_in_a.
         */
        uint32_t sda_lvl:1;
        /** scl_lvl : RO; bitpos: [1]; default: 1;
         *  This bit is used to check the SDA line level to recover from error and  for
         *  debugging. This bit reflects the value of synchronized sda_in_a.
         */
        uint32_t scl_lvl:1;
        /** bus_busy : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t bus_busy:1;
        /** bus_free : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t bus_free:1;
        uint32_t reserved_4:5;
        /** cmd_tid : RO; bitpos: [12:9]; default: 0;
         *  NA
         */
        uint32_t cmd_tid:4;
        /** scl_gen_fsm_state : RO; bitpos: [15:13]; default: 0;
         *  NA
         */
        uint32_t scl_gen_fsm_state:3;
        /** ibi_ev_handle_fsm_state : RO; bitpos: [18:16]; default: 0;
         *  NA
         */
        uint32_t ibi_ev_handle_fsm_state:3;
        /** i2c_mode_fsm_state : RO; bitpos: [21:19]; default: 0;
         *  NA
         */
        uint32_t i2c_mode_fsm_state:3;
        /** sdr_mode_fsm_state : RO; bitpos: [25:22]; default: 0;
         *  NA
         */
        uint32_t sdr_mode_fsm_state:4;
        /** daa_mode_fsm_state : RO; bitpos: [28:26]; default: 0;
         *  Reflects whether the Master Controller is in IDLE or not. This bit will be set when
         *  all the buffer(Command, Response, IBI, Transmit, Receive) are empty along with the
         *  Master State machine is in idle state. 0X0: not in idle  0x1: in idle
         */
        uint32_t daa_mode_fsm_state:3;
        /** main_fsm_state : RO; bitpos: [31:29]; default: 0;
         *  NA
         */
        uint32_t main_fsm_state:3;
    };
    uint32_t val;
} i3c_mst_present_state0_reg_t;


