espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_struct.h
/** Group: I3C PRESENT STATE1 REG */
/** Type of present_state1 register
 *  NA
 */
typedef union {
    struct {
        /** data_byte_cnt : RO; bitpos: [15:0]; default: 0;
         *  Present transfer data byte cnt: tx data byte cnt if write  rx data byte cnt if read
         *  ibi data byte cnt if IBI handle.
         */
        uint32_t data_byte_cnt:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_present_state1_reg_t;


/** Group: I3C DEVICE TABLE REG */
/** Type of device_table register
 *  Pointer for Device Address Table
 */
typedef union {
    struct {
        /** reg_dct_daa_init_index : R/W; bitpos: [3:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_dct_daa_init_index:4;
        /** reg_dat_daa_init_index : R/W; bitpos: [7:4]; default: 0;
         *  NA
         */
        uint32_t reg_dat_daa_init_index:4;
        /** present_dct_index : RO; bitpos: [11:8]; default: 0;
         *  NA
         */
        uint32_t present_dct_index:4;
        /** present_dat_index : RO; bitpos: [15:12]; default: 0;
         *  NA
         */
        uint32_t present_dat_index:4;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_device_table_reg_t;


/** Group: I3C TIME OUT VALUE REG */
/** Type of time_out_value register
 *  NA
 */
typedef union {
    struct {
        /** reg_resp_buf_to_value : R/W; bitpos: [4:0]; default: 16;
         *  NA
         */
        uint32_t reg_resp_buf_to_value:5;
        /** reg_resp_buf_to_en : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t reg_resp_buf_to_en:1;
        /** reg_ibi_data_buf_to_value : R/W; bitpos: [10:6]; default: 16;
         *  NA
         */
        uint32_t reg_ibi_data_buf_to_value:5;
        /** reg_ibi_data_buf_to_en : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t reg_ibi_data_buf_to_en:1;
        /** reg_ibi_status_buf_to_value : R/W; bitpos: [16:12]; default: 16;
         *  NA
         */
        uint32_t reg_ibi_status_buf_to_value:5;
        /** reg_ibi_status_buf_to_en : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t reg_ibi_status_buf_to_en:1;
        /** reg_rx_data_buf_to_value : R/W; bitpos: [22:18]; default: 16;
         *  NA
         */
        uint32_t reg_rx_data_buf_to_value:5;
        /** reg_rx_data_buf_to_en : R/W; bitpos: [23]; default: 0;
         *  NA
         */
        uint32_t reg_rx_data_buf_to_en:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} i3c_mst_time_out_value_reg_t;


/** Group: I3C SCL I3C OD TIME REG */
/** Type of scl_i3c_mst_od_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_od_low_period : R/W; bitpos: [15:0]; default: 25;
         *  SCL Open-Drain low count for I3C transfers targeted to I3C devices.
         */
        uint32_t reg_i3c_mst_od_low_period:16;
        /** reg_i3c_mst_od_high_period : R/W; bitpos: [31:16]; default: 5;
         *  SCL Open-Drain High count for I3C transfers targeted to I3C devices.
         */
        uint32_t reg_i3c_mst_od_high_period:16;
    };
    uint32_t val;
} i3c_mst_scl_i3c_mst_od_time_reg_t;


/** Group: I3C SCL I3C PP TIME REG */
/** Type of scl_i3c_mst_pp_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_pp_low_period : R/W; bitpos: [7:0]; default: 5;
         *  NA
         */
        uint32_t reg_i3c_mst_pp_low_period:8;
        uint32_t reserved_8:8;
        /** reg_i3c_mst_pp_high_period : R/W; bitpos: [23:16]; default: 5;
         *  NA
         */
        uint32_t reg_i3c_mst_pp_high_period:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} i3c_mst_scl_i3c_mst_pp_time_reg_t;


/** Group: I3C SCL I2C FM TIME REG */
/** Type of scl_i2c_fm_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i2c_fm_low_period : R/W; bitpos: [15:0]; default: 163;
         *  NA
         */
        uint32_t reg_i2c_fm_low_period:16;
        /** reg_i2c_fm_high_period : R/W; bitpos: [31:16]; default: 75;
         *  The SCL open-drain low count timing for I2C Fast Mode transfers.
         */
        uint32_t reg_i2c_fm_high_period:16;
    };
    uint32_t val;
} i3c_mst_scl_i2c_fm_time_reg_t;


/** Group: I3C SCL I2C FMP TIME REG */
/** Type of scl_i2c_fmp_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i2c_fmp_low_period : R/W; bitpos: [15:0]; default: 63;
         *  NA
         */
        uint32_t reg_i2c_fmp_low_period:16;
        /** reg_i2c_fmp_high_period : R/W; bitpos: [23:16]; default: 33;
         *  NA
         */
        uint32_t reg_i2c_fmp_high_period:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} i3c_mst_scl_i2c_fmp_time_reg_t;


/** Group: I3C SCL EXT LOW TIME REG */
/** Type of scl_ext_low_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_ext_low_period1 : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t reg_i3c_mst_ext_low_period1:8;
        /** reg_i3c_mst_ext_low_period2 : R/W; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t reg_i3c_mst_ext_low_period2:8;
        /** reg_i3c_mst_ext_low_period3 : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t reg_i3c_mst_ext_low_period3:8;
        /** reg_i3c_mst_ext_low_period4 : R/W; bitpos: [31:24]; default: 0;
         *  NA
         */
        uint32_t reg_i3c_mst_ext_low_period4:8;
    };
    uint32_t val;
} i3c_mst_scl_ext_low_time_reg_t;


/** Group: I3C SDA SAMPLE TIME REG */
/** Type of sda_sample_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_sda_od_sample_time : R/W; bitpos: [8:0]; default: 0;
         *  It is used to adjust sda sample point when scl high under open drain speed
         */
        uint32_t reg_sda_od_sample_time:9;
        /** reg_sda_pp_sample_time : R/W; bitpos: [13:9]; default: 0;
         *  It is used to adjust sda sample point when scl high under push pull speed
         */
        uint32_t reg_sda_pp_sample_time:5;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} i3c_mst_sda_sample_time_reg_t;


/** Group: I3C SDA HOLD TIME REG */
/** Type of sda_hold_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_sda_od_tx_hold_time : R/W; bitpos: [8:0]; default: 1;
         *  It is used to adjust sda drive point after scl neg under open drain speed
         */
        uint32_t reg_sda_od_tx_hold_time:9;
        /** reg_sda_pp_tx_hold_time : R/W; bitpos: [13:9]; default: 0;
         *  It is used to adjust sda dirve point after scl neg under push pull speed
         */
        uint32_t reg_sda_pp_tx_hold_time:5;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} i3c_mst_sda_hold_time_reg_t;


/** Group: I3C SCL START HOLD REG */
/** Type of scl_start_hold register
 *  NA
 */
typedef union {
    struct {
        /** reg_scl_start_hold_time : R/W; bitpos: [8:0]; default: 8;
         *  I2C_SCL_START_HOLD_TIME
         */
        uint32_t reg_scl_start_hold_time:9;
        /** reg_start_det_hold_time : R/W; bitpos: [10:9]; default: 0;
         *  NA
         */
        uint32_t reg_start_det_hold_time:2;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} i3c_mst_scl_start_hold_reg_t;


/** Group: I3C SCL RSTART SETUP REG */
/** Type of scl_rstart_setup register
 *  NA
 */
typedef union {
    struct {
        /** reg_scl_rstart_setup_time : R/W; bitpos: [8:0]; default: 8;
         *  I2C_SCL_RSTART_SETUP_TIME
         */
        uint32_t reg_scl_rstart_setup_time:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} i3c_mst_scl_rstart_setup_reg_t;


