espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_struct.h
/** Group: I3C SCL STOP HOLD REG */
/** Type of scl_stop_hold register
 *  NA
 */
typedef union {
    struct {
        /** reg_scl_stop_hold_time : R/W; bitpos: [8:0]; default: 8;
         *  I2C_SCL_STOP_HOLD_TIME
         */
        uint32_t reg_scl_stop_hold_time:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} i3c_mst_scl_stop_hold_reg_t;


/** Group: I3C SCL STOP SETUP REG */
/** Type of scl_stop_setup register
 *  NA
 */
typedef union {
    struct {
        /** reg_scl_stop_setup_time : R/W; bitpos: [8:0]; default: 8;
         *  I2C_SCL_STOP_SETUP_TIME
         */
        uint32_t reg_scl_stop_setup_time:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} i3c_mst_scl_stop_setup_reg_t;


/** Group: I3C BUS FREE TIME REG */
/** Type of bus_free_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_bus_free_time : R/W; bitpos: [15:0]; default: 5;
         *  I3C Bus Free Count Value. This field is used only in Master mode. In pure Bus
         *  System, this field represents tCAS.  In Mixed Bus System, this field is expected to
         *  be programmed to tLOW of I2C Timing.
         */
        uint32_t reg_bus_free_time:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} i3c_mst_bus_free_time_reg_t;


/** Group: I3C SCL TERMN T EXT LOW TIME REG */
/** Type of scl_termn_t_ext_low_time register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_termn_t_ext_low_time : R/W; bitpos: [7:0]; default: 2;
         *  NA
         */
        uint32_t reg_i3c_mst_termn_t_ext_low_time:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} i3c_mst_scl_termn_t_ext_low_time_reg_t;


/** Group: I3C VER ID REG */
/** Type of ver_id register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_ver_id : R/W; bitpos: [31:0]; default: 539165956;
         *  This field indicates the controller current release number that is read by an
         *  application.
         */
        uint32_t reg_i3c_mst_ver_id:32;
    };
    uint32_t val;
} i3c_mst_ver_id_reg_t;


/** Group: I3C VER TYPE REG */
/** Type of ver_type register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_ver_type : R/W; bitpos: [31:0]; default: 0;
         *  This field indicates the controller current release type that is read by an
         *  application.
         */
        uint32_t reg_i3c_mst_ver_type:32;
    };
    uint32_t val;
} i3c_mst_ver_type_reg_t;


/** Group: I3C FPGA DEBUG PROBE REG */
/** Type of fpga_debug_probe register
 *  NA
 */
typedef union {
    struct {
        /** reg_i3c_mst_fpga_debug_probe : R/W; bitpos: [31:0]; default: 1;
         *  For Debug Probe Test on FPGA
         */
        uint32_t reg_i3c_mst_fpga_debug_probe:32;
    };
    uint32_t val;
} i3c_mst_fpga_debug_probe_reg_t;


/** Group: I3C RND ECO CS REG */
/** Type of rnd_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_rnd_eco_en:1;
        /** rnd_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t rnd_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} i3c_mst_rnd_eco_cs_reg_t;


/** Group: I3C RND ECO LOW REG */
/** Type of rnd_eco_low register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_rnd_eco_low:32;
    };
    uint32_t val;
} i3c_mst_rnd_eco_low_reg_t;


/** Group: I3C RND ECO HIGH REG */
/** Type of rnd_eco_high register
 *  NA
 */
typedef union {
    struct {
        /** reg_rnd_eco_high : R/W; bitpos: [31:0]; default: 65535;
         *  NA
         */
        uint32_t reg_rnd_eco_high:32;
    };
    uint32_t val;
} i3c_mst_rnd_eco_high_reg_t;


typedef struct i3c_mst_dev_t {
    volatile i3c_mst_device_ctrl_reg_t device_ctrl;
    uint32_t reserved_004[6];
    volatile i3c_mst_buffer_thld_ctrl_reg_t buffer_thld_ctrl;
    volatile i3c_mst_data_buffer_thld_ctrl_reg_t data_buffer_thld_ctrl;
    volatile i3c_mst_ibi_notify_ctrl_reg_t ibi_notify_ctrl;
    volatile i3c_mst_ibi_sir_req_payload_reg_t ibi_sir_req_payload;
    volatile i3c_mst_ibi_sir_req_reject_reg_t ibi_sir_req_reject;
    volatile i3c_mst_int_clr_reg_t int_clr;
    volatile i3c_mst_int_raw_reg_t int_raw;
    volatile i3c_mst_int_st_reg_t int_st;
    volatile i3c_mst_int_st_ena_reg_t int_st_ena;
    uint32_t reserved_040;
    volatile i3c_mst_reset_ctrl_reg_t reset_ctrl;
    volatile i3c_mst_buffer_status_level_reg_t buffer_status_level;
    volatile i3c_mst_data_buffer_status_level_reg_t data_buffer_status_level;
    volatile i3c_mst_present_state0_reg_t present_state0;
    volatile i3c_mst_present_state1_reg_t present_state1;
    volatile i3c_mst_device_table_reg_t device_table;
    volatile i3c_mst_time_out_value_reg_t time_out_value;
    volatile i3c_mst_scl_i3c_mst_od_time_reg_t scl_i3c_mst_od_time;
    volatile i3c_mst_scl_i3c_mst_pp_time_reg_t scl_i3c_mst_pp_time;
    volatile i3c_mst_scl_i2c_fm_time_reg_t scl_i2c_fm_time;
    volatile i3c_mst_scl_i2c_fmp_time_reg_t scl_i2c_fmp_time;
    volatile i3c_mst_scl_ext_low_time_reg_t scl_ext_low_time;
    volatile i3c_mst_sda_sample_time_reg_t sda_sample_time;
    volatile i3c_mst_sda_hold_time_reg_t sda_hold_time;
    volatile i3c_mst_scl_start_hold_reg_t scl_start_hold;
    volatile i3c_mst_scl_rstart_setup_reg_t scl_rstart_setup;
    volatile i3c_mst_scl_stop_hold_reg_t scl_stop_hold;
    volatile i3c_mst_scl_stop_setup_reg_t scl_stop_setup;
    uint32_t reserved_08c;
    volatile i3c_mst_bus_free_time_reg_t bus_free_time;
    volatile i3c_mst_scl_termn_t_ext_low_time_reg_t scl_termn_t_ext_low_time;
    uint32_t reserved_098[2];
    volatile i3c_mst_ver_id_reg_t ver_id;
    volatile i3c_mst_ver_type_reg_t ver_type;
    uint32_t reserved_0a8;
    volatile i3c_mst_fpga_debug_probe_reg_t fpga_debug_probe;
    volatile i3c_mst_rnd_eco_cs_reg_t rnd_eco_cs;
    volatile i3c_mst_rnd_eco_low_reg_t rnd_eco_low;
    volatile i3c_mst_rnd_eco_high_reg_t rnd_eco_high;
} i3c_mst_dev_t;

extern i3c_mst_dev_t I3C_MST;

#ifndef __cplusplus
_Static_assert(sizeof(i3c_mst_dev_t) == 0xbc, "Invalid size of i3c_mst_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
